In [1]:
! pip install pyodbc pandas

Collecting pyodbc
  Obtaining dependency information for pyodbc from https://files.pythonhosted.org/packages/7c/6b/f0ad7d8a535d58f35f375ffbf367c68d0ec54452a431d23b0ebee4cd44c6/pyodbc-5.2.0-cp311-cp311-win_amd64.whl.metadata
  Downloading pyodbc-5.2.0-cp311-cp311-win_amd64.whl.metadata (2.8 kB)
Requirement already satisfied: pandas in c:\users\el-wattaneya\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\el-wattaneya\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\el-wattaneya\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\el-wattaneya\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\el-wattaneya\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\el-wattaneya\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pyodbc-5.2.0-cp311-cp311-win_amd64.whl (68 kB)
   ---------------------------------------- 0.0/68.9 kB ? eta -:--:--
   ---------------------------------------- 0.0/68.9 kB ? eta -:--:--
   ----- ---------------------------------- 10.2/68.9 kB ? eta -:--:--
   ----- ---------------------------------- 10.2/68.9 kB ? eta -:--:--
   ----------------------- ---------------- 41.0/68.9 kB 245.8 kB/s eta 0:00:01
   ---------------------------------------- 68.9/68.9 kB 340.9 kB/s eta 0:00:00
Installing collected packages: pyodbc
Successfully installed pyodbc-5.2.0

In [6]:
import pyodbc



connection = pyodbc.connect(
       'DRIVER={SQL Server};''SERVER=PC-1;' 'DATABASE=AdventureWorksLT2022;' 'Trusted_connection =yes'

)

# Create a cursor object to execute queries
cursor = connection.cursor()

print("Connection successful!")

Connection successful!

In [10]:
query = "SELECT TOP 10 CustomerID, FirstName, LastName FROM SalesLT.Customer"
cursor.execute(query)

In [ ]:
# Fetch and print results
for row in cursor.fetchall():
    print(row)

(1, 'Orlando', 'Gee')
(2, 'Keith', 'Harris')
(3, 'Donna', 'Carreras')
(4, 'Janet', 'Gates')
(5, 'Lucy', 'Harrington')
(6, 'Rosmarie', 'Carroll')
(7, 'Dominic', 'Gash')
(10, 'Kathleen', 'Garza')
(11, 'Katherine', 'Harding')
(12, 'Johnny', 'Caprio')

In [ ]:
import pandas as pd

# Example query
query = "SELECT TOP 10 CustomerID, FirstName, LastName FROM SalesLT.Customer"

# Load data into a Pandas DataFrame
# TO parameters(query,connection)
df = pd.read_sql_query(query, connection)

# Display the DataFrame
print(df)

   CustomerID  FirstName    LastName
0           1    Orlando         Gee
1           2      Keith      Harris
2           3      Donna    Carreras
3           4      Janet       Gates
4           5       Lucy  Harrington
5           6   Rosmarie     Carroll
6           7    Dominic        Gash
7          10   Kathleen       Garza
8          11  Katherine     Harding
9          12     Johnny      Caprio

C:\Users\El-Wattaneya\AppData\Local\Temp\ipykernel_9412\697503929.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

In [13]:
df.head()

   CustomerID FirstName    LastName
0           1   Orlando         Gee
1           2     Keith      Harris
2           3     Donna    Carreras
3           4     Janet       Gates
4           5      Lucy  Harrington

In [14]:
query = """
SELECT 
    c.CustomerID, 
    c.FirstName + ' ' + c.LastName AS CustomerName, 
    SUM(sod.LineTotal) AS TotalRevenue
FROM SalesLT.Customer c
JOIN SalesLT.SalesOrderHeader soh ON c.CustomerID = soh.CustomerID
JOIN SalesLT.SalesOrderDetail sod ON soh.SalesOrderID = sod.SalesOrderID
GROUP BY c.CustomerID, c.FirstName, c.LastName
ORDER BY TotalRevenue DESC;
"""

# Execute and load into DataFrame
df = pd.read_sql_query(query, connection)
df

C:\Users\El-Wattaneya\AppData\Local\Temp\ipykernel_9412\2387402280.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

    CustomerID          CustomerName  TotalRevenue
0        29736       Terry Eminhizer  89869.276314
1        30050  Krishna Sunkammurali  79589.616024
2        29546      Christopher Beck  74160.228000
3        29957             Kevin Liu  65683.367986
4        29796            Jon Grande  65123.463418
5        29929         Jeffrey Kurtz  59894.209200
6        29932        Rebecca Laszlo  53248.692000
7        29660          Anthony Chor  47848.026000
8        29938        Frank Campbell  34118.535600
9        29485        Catherine Abel  33319.986000
10       30113        Raja Venugopal  29923.008000
11       29922           Pamala Kotc  28950.678108
12       29653              Pei Chow  11528.844000
13       29877          Joyce Jarvis  10585.050000
14       29531            Cory Booth   5533.868908
15       30027        Joseph Mitzner   2847.408000
16       29975           Walter Mays   2777.143076
17       29982        Melissa Marple   2527.128000
18       30102      Roger Van Houten   1884.394800
19       29568        Donald Blanton   1856.206800
20       29638      Rosmarie Carroll   1732.890000
21       30019        Matthew Miller   1712.946000
22       30089   Michael John Troyer    926.916000
23       29644      Brigid Cavendish    858.900000
24       29847         David Hodgson    713.796000
25       29612         Richard Byham    524.664000
26       30033          Vassar Stern    500.304000
27       29584          Walter Brian    221.256000
28       29781           Guy Gilbert     96.108824
29       30072        Andrea Thomsen     63.900000
30       30025        Linda Mitchell     37.758000
31       29741        Janeth Esteves     31.584000